Revit 2024 API
ScheduleDefinition.ShowTitle Property
 Indicates if the title will be displayed in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public bool ShowTitle { get; set; }
Visual Basic
Public Property ShowTitle As Boolean
	Get
	Set
Visual C++
public:
property bool ShowTitle {
	bool get ();
	void set (bool value);
}
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace